# Taps
tap 'homebrew/cask'
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'

# Binaries
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'svn' # Needed to install fonts

# Development
brew 'php@8.0'
brew 'php@7.4'
brew 'composer'
brew 'mysql'
brew 'nvm'
brew 'yarn'

# Apps
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'ray'
cask 'slack'
cask 'visual-studio-code'
cask 'zoom'
cask 'lastpass'
cask 'evernote'

# Fonts
cask 'font-source-code-pro-for-powerline'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Things', id: 904280696
