# Taps
tap 'homebrew/cask'
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'

# Binaries
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'svn' # Needed to install fonts

# Development
brew 'php@8.0'
brew 'php@7.4'
brew 'composer'
brew 'mysql'
brew 'nvm'
brew 'yarn'
brew 'pnpm'
brew 'youtube-dl'
brew 'ffmpeg'

# Apps
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'visual-studio-code'
cask 'zoom'
cask 'lastpass'
cask '1password'
cask 'evernote'
cask 'raycast'
cask 'encryptme'
cask 'notion'
cask 'fig'
cask 'lando'

# Fonts
cask 'font-source-code-pro-for-powerline'

# Mac App Store
# These might need to be installed manually first
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Things', id: 904280696
mas 'Sleeve', id: 1606145041
mas 'GIPHY Capture. The GIF Maker', id: 668208984